strings = '''05	Добыча угля
05.1	Добыча и обогащение угля и антрацита
05.2	Добыча и обогащение бурого угля (лигнита)
06	Добыча сырой нефти и природного газа
06.1	Добыча сырой нефти и нефтяного (попутного) газа
06.2	Добыча природного газа и газового конденсата
07	Добыча металлических руд
07.1	Добыча и обогащение железных руд
07.2	Добыча руд цветных металлов
08	Добыча прочих полезных ископаемых
08.1	Добыча камня, песка и глины
08.9	Добыча полезных ископаемых, не включенных в другие группировки
09	Предоставление услуг в области добычи полезных ископаемых
09.1	Предоставление услуг в области добычи нефти и природного газа
09.9	Предоставление услуг в других областях добычи полезных ископаемых
19	Производство кокса и нефтепродуктов
19.1	Производство кокса
19.2	Производство нефтепродуктов
19.3	Агломерация угля, антрацита и бурого угля (лигнита) и производство термоуглей
20	Производство химических веществ и химических продуктов
20.1	Производство основных химических веществ, удобрений и азотных соединений, пластмасс и синтетического каучука в первичных формах
20.2	Производство пестицидов и прочих агрохимических продуктов
20.3	Производство красок, лаков и аналогичных материалов для нанесения покрытий, полиграфических красок и мастик
20.4	Производство мыла и моющих, чистящих и полирующих средств; парфюмерных и косметических средств
20.5	Производство прочих химических продуктов
20.6	Производство химических волокон
22	Производство резиновых и пластмассовых изделий
22.1	Производство резиновых изделий
22.2	Производство изделий из пластмасс
23	Производство прочей неметаллической минеральной продукции
23.1	Производство стекла и изделий из стекла
23.2	Производство огнеупорных изделий
23.3	Производство строительных керамических материалов
23.4	Производство прочих фарфоровых и керамических изделий
23.5	Производство цемента, извести и гипса
23.6	Производство изделий из бетона, цемента и гипса
23.7	Резка, обработка и отделка камня
23.9	Производство абразивных и неметаллических минеральных изделий, не включенных в другие группировки
24	Производство металлургическое
24.1	Производство чугуна, стали и ферросплавов
24.2	Производство стальных труб, полых профилей и фитингов
24.3	Производство прочих стальных изделий первичной обработкой
24.4	Производство основных драгоценных металлов и прочих цветных металлов, производство ядерного топлива
24.46	Производство ядерного топлива
24.5	Литье металлов
25	Производство готовых металлических изделий, кроме машин и оборудования
25.1	Производство строительных металлических конструкций и изделий
25.2	Производство металлических цистерн, резервуаров и прочих емкостей
25.3	Производство паровых котлов, кроме котлов центрального отопления
25.4	Производство оружия и боеприпасов
25.5	Ковка, прессование, штамповка и профилирование; изготовление изделий методом порошковой металлургии
25.6	Обработка металлов и нанесение покрытий на металлы; механическая обработка металлов
25.7	Производство ножевых изделий и столовых приборов, инструментов и универсальных скобяных изделий
25.9	Производство прочих готовых металлических изделий
26	Производство компьютеров, электронных и оптических изделий
26.1	Производство элементов электронной аппаратуры и печатных схем (плат)
26.2	Производство компьютеров и периферийного оборудования
26.3	Производство коммуникационного оборудования
26.4	Производство бытовой электроники
26.5	Производство контрольно-измерительных и навигационных приборов и аппаратов; производство часов
26.6	Производство облучающего и электротерапевтического оборудования, применяемого в медицинских целях
26.7	Производство оптических приборов, фото- и кинооборудования
26.8	Производство незаписанных магнитных и оптических технических носителей информации
27	Производство электрического оборудования
27.1	Производство электродвигателей, генераторов, трансформаторов и распределительных устройств, а также контрольно-измерительной аппаратуры
27.12	Производство электрической распределительной и регулирующей аппаратуры
27.2	Производство электрических аккумуляторов и аккумуляторных батарей
27.3	Производство кабелей и кабельной арматуры
27.4	Производство электрических ламп и осветительного оборудования
27.5	Производство бытовых приборов
27.9	Производство прочего электрического оборудования
28	Производство машин и оборудования, не включенных в другие группировки
28.1	Производство машин и оборудования общего назначения
28.2	Производство прочих машин и оборудования общего назначения
28.3	Производство машин и оборудования для сельского и лесного хозяйства
28.4	Производство станков, машин и оборудования для обработки металлов и прочих твердых материалов
28.9	Производство прочих машин специального назначения
29	Производство автотранспортных средств, прицепов и полуприцепов
29.1	Производство автотранспортных средств
29.2	Производство кузовов для автотранспортных средств; производство прицепов и полуприцепов
29.3	Производство комплектующих и принадлежностей для автотранспортных средств
30	Производство прочих транспортных средств и оборудования
30.1	Строительство кораблей, судов и лодок
30.2	Производство железнодорожных локомотивов и подвижного состава
30.3	Производство летательных аппаратов, включая космические, и соответствующего оборудования
30.4	Производство военных боевых машин
30.9	Производство транспортных средств и оборудования, не включенных в другие группировки
33	Ремонт и монтаж машин и оборудования
33.1	Ремонт и монтаж металлических изделий, машин и оборудования
33.2	Монтаж промышленных машин и оборудования
33.20	Монтаж промышленных машин и оборудования
35	Обеспечение электрической энергией, газом и паром; кондиционирование воздуха
35.1	Производство, передача и распределение электроэнергии
35.2	Производство и распределение газообразного топлива
35.3	Производство, передача и распределение пара и горячей воды; кондиционирование воздуха
36	Забор, очистка и распределение воды
36.0	Забор, очистка и распределение воды
37	Сбор и обработка сточных вод
37.0	Сбор и обработка сточных вод
37.00	Сбор и обработка сточных вод
38	Сбор, обработка и утилизация отходов; обработка вторичного сырья
38.1	Сбор отходов
38.2	Обработка и утилизация отходов
38.3	Деятельность по обработке вторичного сырья
39	Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов
39.0	Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов
39.00	Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов
42	Строительство инженерных сооружений
42.1	Строительство автомобильных и железных дорог
42.2	Строительство инженерных коммуникаций
42.9	Строительство прочих инженерных сооружений
43	Работы строительные специализированные
43.1	Разборка и снос зданий, подготовка строительного участка
43.2	Производство электромонтажных, санитарно-технических и прочих строительно-монтажных работ
43.3	Работы строительные отделочные
43.9	Работы строительные специализированные прочие
46	Торговля оптовая, кроме оптовой торговли автотранспортными средствами и мотоциклами
46.1	Торговля оптовая за вознаграждение или на договорной основе
46.2	Торговля оптовая сельскохозяйственным сырьем и живыми животными
46.3	Торговля оптовая пищевыми продуктами, напитками и табачными изделиями
46.4	Торговля оптовая непродовольственными потребительскими товарами
46.5	Торговля оптовая информационным и коммуникационным оборудованием
46.6	Торговля оптовая прочими машинами, оборудованием и принадлежностями
46.7	Торговля оптовая специализированная прочая
46.9	Торговля оптовая неспециализированная
47	Торговля розничная, кроме торговли автотранспортными средствами и мотоциклами
47.1	Торговля розничная в неспециализированных магазинах
47.11	Торговля розничная преимущественно пищевыми продуктами, включая напитки, и табачными изделиями в неспециализированных магазинах
47.2	Торговля розничная пищевыми продуктами, напитками и табачными изделиями в специализированных магазинах
47.3	Торговля розничная моторным топливом в специализированных магазинах
47.4	Торговля розничная информационным и коммуникационным оборудованием в специализированных магазинах
47.5	Торговля розничная прочими бытовыми изделиями в специализированных магазинах
47.6	Торговля розничная товарами культурно-развлекательного назначения в специализированных магазинах
47.7	Торговля розничная прочими товарами в специализированных магазинах
47.8	Торговля розничная в нестационарных торговых объектах и на рынках
47.9	Торговля розничная вне магазинов, палаток, рынков
49	Деятельность сухопутного и трубопроводного транспорта
49.1	Деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки
49.2	Деятельность железнодорожного транспорта: грузовые перевозки
49.3	Деятельность прочего сухопутного пассажирского транспорта
49.4	Деятельность автомобильного грузового транспорта и услуги по перевозкам
49.5	Деятельность трубопроводного транспорта
50	Деятельность водного транспорта
50.1	Деятельность морского пассажирского транспорта
50.2	Деятельность морского грузового транспорта
50.3	Деятельность внутреннего водного пассажирского транспорта
50.4	Деятельность внутреннего водного грузового транспорта
52	Складское хозяйство и вспомогательная транспортная деятельность
52.1	Деятельность по складированию и хранению
52.2	Деятельность транспортная вспомогательная
62	Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги
62.0	Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги
63	Деятельность в области информационных технологий
63.1	Деятельность по обработке данных, предоставление услуг по размещению информации, деятельность порталов в информационно-коммуникационной сети Интернет
63.9	Деятельность в области информационных услуг прочая
64	Деятельность по предоставлению финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению
64.1	Денежное посредничество
64.2	Деятельность холдинговых компаний
64.3	Деятельность инвестиционных фондов и аналогичных финансовых организаций
64.9	Деятельность по предоставлению прочих финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению
66	Деятельность вспомогательная в сфере финансовых услуг и страхования
66.1	Деятельность вспомогательная в сфере финансовых услуг, кроме страхования и пенсионного обеспечения
66.2	Деятельность вспомогательная в сфере страхования и пенсионного обеспечения
66.3	Деятельность по управлению фондами
69	Деятельность в области права и бухгалтерского учета
69.1	Деятельность в области права
69.2	Деятельность по оказанию услуг в области бухгалтерского учета, по проведению финансового аудита, по налоговому консультированию
71	Деятельность в области архитектуры и инженерно-технического проектирования; технических испытаний, исследований и анализа
71.1	Деятельность в области архитектуры, инженерных изысканий и предоставление технических консультаций в этих областях
71.2	Технические испытания, исследования, анализ и сертификация
72	Научные исследования и разработки
72.1	Научные исследования и разработки в области естественных и технических наук
72.2	Научные исследования и разработки в области общественных и гуманитарных наук
73	Деятельность рекламная и исследование конъюнктуры рынка
73.1	Деятельность рекламная
73.2	Исследование конъюнктуры рынка и изучение общественного мнения
74	Деятельность профессиональная научная и техническая прочая
74.1	Деятельность специализированная в области дизайна
74.2	Деятельность в области фотографии
74.3	Деятельность по письменному и устному переводу
74.9	Деятельность профессиональная, научная и техническая прочая, не включенная в другие группировки
77	Аренда и лизинг
77.1	Аренда и лизинг автотранспортных средств
77.2	Прокат и аренда предметов личного пользования и хозяйственно-бытового назначения
77.3	Аренда и лизинг прочих машин и оборудования и материальных средств
77.4	Аренда интеллектуальной собственности и подобной продукции, кроме авторских прав
78	Деятельность по трудоустройству и подбору персонала
78.1	Деятельность агентств по подбору персонала
78.2	Деятельность агентств по временному трудоустройству
78.3	Деятельность по подбору персонала прочая
94	Деятельность общественных организаций
94.1	Деятельность коммерческих, предпринимательских и профессиональных организаций
94.2	Деятельность профессиональных союзов
94.9	Деятельность прочих общественных организаций'''

lines = strings.splitlines()
classes = []
subclasses = []
for line in lines:
    num, name = line.rstrip('\n').split('\t')
    if '.' in num:
        subclasses.append(f'"{num} {name}"')
    else:
        classes.append(f'"{num} {name}"')

print(*classes, sep='\n')
print(*subclasses, sep=',\n')